package homework.didukhigor.homework.javacore6.salary;
//1. Створити interface Зарплата, в якому передбачити метод зарплата().
// Створити клас Працівник з погодинною зарплатою, та Працівник з фіксованою місячною зарплатою .
// Реалізувати методи інтерфейсу в к класах : Працівник з погодинною зарплатою,
// та Працівник з фіксованою місячною зарплатою . Формула розрахунку зарплати працівника є довільною.
// Вивести на екран скільки заробляють перший і другий працівники.

public interface Salary {

    public void salary();
}
