package homework.katerynakikidzhan.JC04.first;
//1) Створити клас Robot від якого слід унаслідувати CoffeRobot, RobotDancer, RobotCoocker.
//В Robot є метод work(),  в якому слід описати роботу яку виконує кожен з роботів.
//Для Robot в методі work() слід написати код, щоб на консоль виводився наступний текст «Я Robot – я просто працюю».
//Для CoffeRobot в методі work() слід написати код, щоб на консоль виводився наступний текст «Я CoffeRobot – я варю каву».
//Для RobotDancer в методі work() слід написати код, щоб на консоль виводився наступний текст «Я RobotDancer – я просто танцюю».
//Для RobotCoocker в методі work() слід написати код, щоб на консоль виводився наступний текст «Я RobotCoocker – я просто готую».
//Створити в Main класі екземпляри вищеописаних класів і викликати до кожного з них метод work().
//Створити в Main класі масив класу Robot , заповнити масив екземплярами вищеописаних класів.
//Створити цикл for , пройтись по всіх елементах масиву і викликати для кожного елемент масиву метод work().
public class Robot {
    public void work() {
        System.out.println("Я Robot — я просто працюю.");
    }
}
